_real_loadable_dump/Documents/ОплатаЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОплатаЗаказа</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
		<Attribute>
			<Properties>
				<Name>Заказ</Name>
				<Type>
					<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>ВидОплаты</Name>
				<Type>
					<v8:Type>cfg:EnumRef.ВидОплаты</v8:Type>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>СтатусОплаты</Name>
				<Type>
					<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>ФормаОплаты</Name>
				<Type>
					<v8:Type>cfg:EnumRef.ФормаОплаты</v8:Type>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>КонтрагентЗаказчик</Name>
				<Type>
					<v8:Type>cfg:CatalogRef.Заказчики</v8:Type>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>КонтрагентПоставщик</Name>
				<Type>
					<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>КонтрагентПеревозчик</Name>
				<Type>
					<v8:Type>cfg:CatalogRef.Перевозчики</v8:Type>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>Валюта</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>3</v8:Length>
					</v8:StringQualifiers>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>Сумма</Name>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>15</v8:Digits>
						<v8:FractionDigits>2</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>СуммаРуб</Name>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>15</v8:Digits>
						<v8:FractionDigits>2</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>КурсВалюты</Name>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>15</v8:Digits>
						<v8:FractionDigits>6</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>СтатьяДДС</Name>
				<Type>
					<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>ДатаОплатыПлан</Name>
				<Type>
					<v8:Type>xs:dateTime</v8:Type>
					<v8:DateQualifiers>
						<v8:DateFractions>Date</v8:DateFractions>
					</v8:DateQualifiers>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>ДатаОплатыФакт</Name>
				<Type>
					<v8:Type>xs:dateTime</v8:Type>
					<v8:DateQualifiers>
						<v8:DateFractions>Date</v8:DateFractions>
					</v8:DateQualifiers>
				</Type>
			</Properties>
		</Attribute>
		<Attribute>
			<Properties>
				<Name>Комментарий</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>250</v8:Length>
					</v8:StringQualifiers>
				</Type>
			</Properties>
		</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

_real_loadable_dump/Enums/ВидОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтЗаказчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перевозчику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_real_loadable_dump/Documents/ОплатаЗаказа/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если НЕ ЗначениеЗаполнено(Заказ) Тогда
		Сообщить("Не заполнен заказ.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Сумма <= 0 Тогда
		Сообщить("Сумма оплаты должна быть больше нуля.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ВидОплаты) Тогда
		Сообщить("Не заполнен вид оплаты.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ВидОплаты = Перечисления.ВидОплаты.ОтЗаказчика И НЕ ЗначениеЗаполнено(КонтрагентЗаказчик) Тогда
		Сообщить("Для вида оплаты ""От заказчика"" заполните заказчика.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ВидОплаты = Перечисления.ВидОплаты.Поставщику И НЕ ЗначениеЗаполнено(КонтрагентПоставщик) Тогда
		Сообщить("Для вида оплаты ""Поставщику"" заполните поставщика.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ВидОплаты = Перечисления.ВидОплаты.Перевозчику И НЕ ЗначениеЗаполнено(КонтрагентПеревозчик) Тогда
		Сообщить("Для вида оплаты ""Перевозчику"" заполните перевозчика.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(КурсВалюты) ИЛИ КурсВалюты = 0 Тогда
		КурсВалюты = 1;
	КонецЕсли;
	СуммаРуб = Сумма * КурсВалюты;

	Если НЕ ЗначениеЗаполнено(ДатаОплатыФакт) Тогда
		ДатаОплатыФакт = Дата;
	КонецЕсли;

КонецПроцедуры

Процедура ПриПроведении(Отказ, РежимПроведения)
	ЛогикаФинансов.ЗарегистрироватьОплату(ЭтотОбъект);
КонецПроцедуры
